#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.assume_role_policy: Reading...
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-2:071148681943:cluster/ecs_cluster]
aws_vpc.my_vpc: Refreshing state... [id=vpc-0408fd85322ef8820]
data.aws_ecr_repository.tessian-demo-ramg: Reading...
data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
aws_iam_role.testecsTaskExecutionRole: Refreshing state... [id=testecsTaskExecutionRole]
data.aws_ecr_repository.tessian-demo-ramg: Read complete after 1s [id=tessian-demo-ramg]
aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=testecsTaskExecutionRole-20230807185900577600000001]
aws_ecs_task_definition.task_definition: Refreshing state... [id=task]
aws_subnet.pub-subnet2: Refreshing state... [id=subnet-0439bc9d37ee91611]
aws_internet_gateway.gw: Refreshing state... [id=igw-0d84d1c4cc2e94d54]
aws_subnet.pub-subnet1: Refreshing state... [id=subnet-03a85786c7ba1bfbd]
aws_security_group.ecs_sg: Refreshing state... [id=sg-010b31a39c5c3bb09]
aws_route_table.main-route-table: Refreshing state... [id=rtb-0c9d4d82e5eabba72]
aws_lb.test-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:071148681943:loadbalancer/app/test-lb/63246a5f46e15639]
aws_route_table_association.public1_association: Refreshing state... [id=rtbassoc-046a8914939c8ee38]
aws_route_table_association.public2_association: Refreshing state... [id=rtbassoc-02108a44e69dba4ec]
aws_lb_listener.https_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:071148681943:listener/app/test-lb/63246a5f46e15639/5e0acdfcec1a5730]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb_listener_rule.my_listener_rule will be created
  + resource "aws_lb_listener_rule" "my_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:eu-west-2:071148681943:listener/app/test-lb/63246a5f46e15639/5e0acdfcec1a5730"
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "OK"
              + status_code  = "200"
            }
        }

      + condition {

          + http_request_method {
              + values = [
                  + "GET",
                ]
            }

          + path_pattern {
              + values = [
                  + "/",
                ]
            }
        }
    }

  # aws_lb_target_group.test-tg will be created
  + resource "aws_lb_target_group" "test-tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "test-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0408fd85322ef8820"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 120
          + matcher             = (known after apply)
          + path                = "/api/emails"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @ramg777, Action: `pull_request`*